{
  "Menu": {
    "hello": "Hello",
    "about-me": "About me",
    "my-work": "My work",
    "reviews": "Reviews",
    "contact": "Contact"
  },
  "Hello": {
    "hello": "Hi, I'm",
    "position": "a Frontend Developer",
    "description": "Transforming ideas into elegant and visually appealing solutions with <Highlighted>flexibility and attention to detail</Highlighted>, simplifying processes and delivering clear and concise code."
  },
  "AboutMe": {
    "title": "About Me",
    "description": {
      "first": "I started my career in 2021 as a frontend developer, working with pure JavaScript and focusing on simple designs for various companies.",
      "second": "I have a true passion for creating captivating landing pages. Currently, I continue as a frontend developer, using pure JavaScript, React, and Next.js to create engaging and effective digital experiences, always following the latest industry trends.",
      "third": "I have eclectic musical tastes, enjoying everything from MPB and sertanejo to electronic and pop. Additionally, I love being in touch with nature, hiking, and running in city parks. I have two pets, Cão, a dog, and Dani, a cat, who stay on the farm when I travel."
    }
  },
  "MyWork": {
    "title": "My Work",
    "description": "The technologies I use are listed below."
  },
  "Projects": {
    "defense-ia": {
      "name": "DEFENSE IA - ACCESS CONTROL",
      "description": "Intelligent access control system with AI for enterprise security. Developed with modern technologies to ensure maximum security and efficiency."
    },
    "qr-creator": {
      "name": "QR CODE CREATOR",
      "description": "Web application for creating and customizing QR codes with different styles and functionalities. Intuitive and responsive interface."
    },
    "video-cleaner": {
      "name": "VIDEO METADATA CLEANER",
      "description": "Desktop application for cleaning video metadata using FFmpeg. Modern interface with drag-and-drop for easy use."
    }
  },
  "Reviews": {
    "title": "Reviews",
    "description": "Reviews de clientes"
  },
  "Contact": {
    "title": "Send a message",
    "description": "Contact me",
    "placeholders": {
      "name": "Enter your name",
      "email": "Enter your email",
      "message": "Enter your message"
    },
    "errors": {
      "name": "Name is required.",
      "email": {
        "required": "Email is required.",
        "invalid": "Invalid email."
      },
      "message": "Message is required."
    },
    "status": {
      "sending": "Sending...",
      "success": "Email sent successfully!",
      "error": "Error sending the email."
    }
  }
}
